# OriginalLinetypeName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeKey..::..OriginalLinetypeName Property
ExportLinetypeKey Class See Also
---
The original linetype name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string OriginalLinetypeName { get; set; }
```

Visual Basic
---
```text
Public Property OriginalLinetypeName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ OriginalLinetypeName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ExportLinetypeKey Class
Autodesk.Revit.DB Namespace